app/controllers/api/v1/opt_ins_controller.rb

  def set_subscription
    @subscription = Subscription.find_by_product_id_and_organization_id(params[:product_id], @organization.id)
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."deleted_at" IS NULL AND "subscriptions"."product_id" = ? AND "subscriptions"."organization_id" = ?  ORDER BY "subscriptions"."id" ASC LIMIT 1  [["product_id", 1], ["organization_id", 2]]