app/controllers/api/v1/safetexts_controller.rb

  def create
    validate_create_params
    @subscription = Subscription.find_by_organization_id_and_product_id(@organization.id, 3)
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."deleted_at" IS NULL AND "subscriptions"."organization_id" = ? AND "subscriptions"."product_id" = ? LIMIT 1  [["organization_id", 2], ["product_id", 3]]

  def find_and_set_opt_in
    find_and_set_customer
    @opt_in = OptIn.find_by_customer_id_and_subscription_id(@customer.id, @subscription.id)
---
SELECT  "opt_ins".* FROM "opt_ins" WHERE "opt_ins"."deleted_at" IS NULL AND "opt_ins"."customer_id" = ? AND "opt_ins"."subscription_id" = ? LIMIT 1  [["customer_id", 47], ["subscription_id", 6]]

  def find_and_set_customer
    if !params[:customer_uid].blank?
      @customer = Customer.find_by_subscription_id_and_uid(@subscription.id, params[:customer_uid])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."deleted_at" IS NULL AND "customers"."subscription_id" = ? AND "customers"."uid" = ? LIMIT 1  [["subscription_id", 6], ["uid", "dwbefkwefwhjkd3221e3eekwfw"]]