app/controllers/twilio_controller.rb

  def status
    @message = Message.find(params[:id])
    @message.update_attributes(sid: params["MessageSid"], status: params["SmsStatus"])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."deleted_at" IS NULL AND "messages"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "messages" SET "sid" = ?, "status" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["sid", "SM4126ea5d25cf45a6ae185315e75a11b0"], ["status", "sent"], ["updated_at", "2015-12-24 09:18:44.211756"], ["id", 2]]

  def set_incoming_message_purpose
    @incoming_message.purpose = @opt_in
    @incoming_message.save
---
INSERT INTO "messages" ("from", "to", "body", "kind", "purpose_type", "purpose_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "messages" SET "purpose_id" = ?, "purpose_type" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["purpose_id", 49], ["purpose_type", "OptIn"], ["updated_at", "2015-12-26 21:05:04.921337"], ["id", 61]]
UPDATE "opt_ins" SET "completed" = ?, "updated_at" = ? WHERE "opt_ins"."id" = ?  [["completed", "t"], ["updated_at", "2015-12-24 09:56:47.735713"], ["id", 19]]

  def set_customer
    @customer = Customer.find_by_phone(@incoming_message.from)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."deleted_at" IS NULL AND "customers"."phone" = ? LIMIT 1  [["phone", "+2348028618180"]]