app/controllers/dashboard/v1/organizations_controller.rb

  def index
    respond_with Organization.all
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."deleted_at" IS NULL

  def show
    respond_with Organization.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."deleted_at" IS NULL AND "organizations"."id" = ? LIMIT 1  [["id", 1]]

  def create
    ActiveRecord::Base.transaction do
      @organization = Organization.new(organization_params)
      if @organization.save && create_primary_user_account
---
INSERT INTO "organizations" ("organization_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["organization_name", "Helloworld.ng"], ["email", "timi@helloworld.ng"], ["created_at", "2015-12-08 16:29:44.014365"], ["updated_at", "2015-12-08 16:29:44.014365"]]
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "is_primary", "tokens", "uid", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)