app/controllers/dashboard/v1/subscriptions_controller.rb

  def create
    param! :feature_ids, Array, required: true
    subscriptions = []
    feature_ids = params[:feature_ids]
    feature_ids.each do |feature_id|
      feature_name = Feature.find(feature_id).name.capitalize
      corresponding_options_model = create_options_with_defaults(feature_name)
      subscription = Subscription.create(organization_id: current_user.organization.id, feature_id: feature_id)
      subscription.options = corresponding_options_model
      subscription.save
---
INSERT INTO "subscriptions" ("organization_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["organization_id", 1], ["product_id", 1], ["created_at", "2015-12-08 16:30:11.083062"], ["updated_at", "2015-12-08 16:30:11.083062"]]
UPDATE "subscriptions" SET "options_type" = ?, "options_id" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["options_type", "KeywordOptions"], ["options_id", "1"], ["updated_at", "2015-12-08 16:30:11.095749"], ["id", 1]]
UPDATE "users" SET "tokens" = ?, "updated_at" = ? WHERE "users"."id" = ?

  def set_variables
    @subscription = Subscription.find(params[:id])
    @options = @subscription.options
    unless current_user.organization.subscriptions.exists?(@subscription)
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."deleted_at" IS NULL AND "subscriptions"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."deleted_at" IS NULL AND "organizations"."id" = ? LIMIT 1  [["id", 2]]
SELECT  1 AS one FROM "subscriptions" WHERE "subscriptions"."deleted_at" IS NULL AND "subscriptions"."organization_id" = ? AND "subscriptions"."id" = ? LIMIT 1  [["organization_id", 2], ["id", 5]]